# Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….

a = 1
for i in range(55):
    print(a)
    a += 2
