# Создайте программу, выводящую на экран первые 20 элементов последовательности
# 2 4 8 16 32 64 128
a = 2
for i in range(20):
    print(a)
    a *= 2
